#include"data/rules.hpp"
#include<vector>
#include<string>

rules::rules()
{
	SchoolRule.push_back(
		{
			"第四条（一）",
			{
				{"班长等班委", true, 2, 5},
				{"宣传委员", true, 2, 5},
				{"学生会组织部部长", true, 2, 5},
				{"当月升旗服装统一", true, 4, 4},
				{"X月全勤", true, 5, 5},
				{"通21-XXX第X周文明宿舍", true, 2, 2},
				{"通21-XXX第X周标杆宿舍", true, 3, 3},
				{"通21-XXXX月文明宿舍", true, 5, 5},
				{"积极报名参加XX讲座", true, 2, 2},
				{"其它学校或辅导员安排的临时性活动", true, 2, 3},
				{"较上月进步xx分", true, 2, 3},
				{"勤工俭学(xx工作）", true, 2, 5},
				{"班会回答问题正确", true, 1, 1},
				{"通1－111寝室长", true, 2, 5},
				{"携带班级座牌", true, 5, 5},
				{"参加学习辅导", true, 2, 2},
				{"拾金不昧（捡手机，银行卡，饭卡）", true, 2, 2},
				{"班级集体荣誉（写具体名称）", true, 2, 5},
				{"积极参加XX竞赛/运动会XX项目", true, 2, 2},
				{"优秀学生", true, 4, 4},
				{"优秀团员", true, 4, 4},
				{"义务劳动（XX公益活动）", true, 2, 3},
				{"优秀团支部（仅团员加分）", true, 2, 3},
				{"青年志愿者活动", true, 2, 3},
				{"XX竞赛一等奖（校）", true, 2, 10},
				{"十佳歌手（校）", true, 2, 10},
				{"英语A/B级证书", true, 8, 8},
				{"计算机一级证书", true, 8, 8}
			}
		}
	);

	SchoolRule.push_back(
		{
			"第四条（二）",
			{
				{"第3节思修迟到", false, -5, -5},
				{"第4节语文早退", false, -5, -5},
				{"请xx假x节", false, -10, -0.5},
				{"第5－6节高数旷课", false, -20, -20},
				{"第5节XX课旷课", false, -10, -10},
				{"无故不参加升旗", false, -10, -10},
				{"无故不参加集体活动", false, -10, -10},
				{"通7-106第X周最差宿舍", false, -16, -2},
				{"通7-106 X月最差宿舍", false, -5, -5},
				{"班会回答问题错误", false, -1, -1},
				{"座牌损坏/污损不及时补办", false, -2, -2},
				{"第6节上课无座牌/不摆放座牌", false, -2, -2},
				{"晚归（22：30以后归）", false, -10, -10},
				{"不按时打止/不打卡", false, -5, -5},
				{"上课迟到督促不动", false, -5, -5},
				{"升旗服装不统一", false, -2, -2},
				{"辅导员课请假", false, -0.5, -0.5},
				{"放假返校当晚20：00未归亦未主动说明", false, -10, -10},
				{"学生干部不按时（量，质）完成任务", false, -2, -2},
				{"染发被查处", false, -3, -3},
				{"公众场合抽烟，穿拖鞋、乱扔垃圾", false, -3, -3},
				{"顶撞教职工/学生干部", false, -10, -10},
				{"夜晚影响他人休息", false, -3, -3},
				{"欺骗他人", false, -5, -5},
				{"强冲门岗", false, -5, -5},
				{"教室或寝室使用大功率用电器", false, -5, -5},
				{"报名竞赛/运动会无故不参加", false, -5, -5},
				{"受到纪律处分", false, -30, -15},
				{"考试作弊、夹带、违纪", false, -10, -10},
				{"辱骂教职工或学生干部", false, -20, -10},
				{"损坏公物或他人财物", false, -5, -5},
				{"盗用公章或签名", false, -10, -10},
				{"恐吓、诽谤他人", false, -10, -10},
				{"22：30以后使用音响", false, -5, -5}
			}
		}
	);
}